---
kind: type
id: T:Autodesk.Revit.DB.ModelEllipse
source: html/1d81b0d6-be6e-2766-d21b-c635115f2ff9.htm
---
# Autodesk.Revit.DB.ModelEllipse

Represents a ModelEllipse within Autodesk Revit.

## Syntax (C#)
```csharp
public class ModelEllipse : ModelCurve
```

## Remarks
Currently it's just a place holder for specific type.
All the geometry-related functionality is provided by geometry curve object from
ModelCurve::geometryCurve property.